---
title: bridges
description: Leverage Memgraph's bridge functions to optimize your graph analysis capabilities. Explore the advanced algorithmic potential with tailored tutorials and our docs.
---

import { Steps } from 'nextra/components'
import { Callout } from 'nextra/components'
import { Card, Cards } from 'nextra/components'
import GitHub from '/components/icons/GitHub'

# bridges

A bridge in the graph can be described as an relationship which if deleted,
creates two disjoint graph components. This algorithm finds bridges within the
graph. It has various practical usages such as road or internet network design
planning. A bridge can represent a bottleneck for many scenarios and it is
valuable to detect it on time.

<Cards>
  <Card
    icon={<GitHub />}
    title="Source code"
    href="https://github.com/memgraph/mage/blob/main/cpp/bridges_module/bridges_module.cpp"
  />
</Cards>

| Trait               | Value                                                 |
| ------------------- | ---------- |
| **Module type**     | algorithm  |
| **Implementation**  | C++        |
| **Graph direction** | undirected |
| **Edge weights**    | unweighted |
| **Parallelism**     | sequential |

## Procedures

<Callout type="info">
You can execute this algorithm on [graph projections, subgraphs or portions of the graph](/advanced-algorithms/run-algorithms#run-procedures-on-subgraph).
</Callout>

### `get()`

{<h4> Output: </h4>}

* `node_from: Vertex` ➡ Represents the first node in a bridge relationship.
* `node_to: Vertex` ➡ Represents the second node in a bridge relationship.

{<h4> Usage: </h4>}

```cypher
CALL bridges.get()
YIELD node_from, node_to;
```

## Example

<Steps>

{<h3> Database state </h3>} 

The database contains the following data: 

![](/pages/advanced-algorithms/available-algorithms/bridges/bridges-1.png)

Created with the following Cypher queries:

```cypher
MERGE (a:Node {id: 1}) MERGE (b:Node {id: 0}) CREATE (a)-[:RELATION]->(b);
MERGE (a:Node {id: 2}) MERGE (b:Node {id: 0}) CREATE (a)-[:RELATION]->(b);
MERGE (a:Node {id: 2}) MERGE (b:Node {id: 1}) CREATE (a)-[:RELATION]->(b);
MERGE (a:Node {id: 0}) MERGE (b:Node {id: 3}) CREATE (a)-[:RELATION]->(b);
MERGE (a:Node {id: 3}) MERGE (b:Node {id: 4}) CREATE (a)-[:RELATION]->(b);
```

{<h3> Identify bridge relationships </h3>} 

Get the values using the following query:

```cypher
CALL bridges.get() YIELD node_from, node_to
WITH node_from, node_to
MATCH (node_from)-[bridge]-(node_to)
RETURN bridge, node_from, node_to;
```

Results:

```plaintext
+-----------------+-----------------+-----------------+
| bridge          | node_from       | node_to         |
+-----------------+-----------------+-----------------+
| [:RELATION]     | (:Node {id: 3}) | (:Node {id: 4}) |
| [:RELATION]     | (:Node {id: 0}) | (:Node {id: 3}) |
+-----------------+-----------------+-----------------+
```
</Steps>
