import { Steps } from 'nextra/components'

# bridges

export const Highlight = ({children, color}) => (
  <span
    style={{
      backgroundColor: color,
      borderRadius: '2px',
      color: '#fff',
      padding: '0.2rem',
    }}>
    {children}
  </span>
);

A bridge in the graph can be described as an edge which if deleted, creates two disjoint graph components. This algorithm finds bridges within the graph. This algorithm has various practical usages such can be road or internet network design planning. A bridge can represent a bottleneck for many scenarios and it is valuable to have such an algorithm to detect it.

[![docs-source](https://img.shields.io/badge/source-bridges-FB6E00?logo=github&style=for-the-badge)](https://github.com/memgraph/mage/blob/main/cpp/bridges_module/bridges_module.cpp)

| Trait               | Value                                                 |
| ------------------- | ----------------------------------------------------- |
| **Module type**     | <Highlight color="#FB6E00">**algorithm**</Highlight>  |
| **Implementation**  | <Highlight color="#FB6E00">**C++**</Highlight>        |
| **Graph direction** | <Highlight color="#FB6E00">**undirected**</Highlight> |
| **Edge weights**    | <Highlight color="#FB6E00">**unweighted**</Highlight> |
| **Parallelism**     | <Highlight color="#FB6E00">**sequential**</Highlight> |

## Procedures

### `get()`

#### Output:

* `node_from` ➡ Represents the first node in bridge edge
* `node_to` ➡ Represents the second node in bridge edge

#### Usage:
```cypher
CALL bridges.get()
YIELD node_from, node_to;
```

## Example

<Steps>
### Input graph
![](/pages/advanced-algorithms/available-algorithms/bridges/bridges-1.png)

### Cypher load commands
```cypher
MERGE (a:Node {id: 1}) MERGE (b:Node {id: 0}) CREATE (a)-[:RELATION]->(b);
MERGE (a:Node {id: 2}) MERGE (b:Node {id: 0}) CREATE (a)-[:RELATION]->(b);
MERGE (a:Node {id: 2}) MERGE (b:Node {id: 1}) CREATE (a)-[:RELATION]->(b);
MERGE (a:Node {id: 0}) MERGE (b:Node {id: 3}) CREATE (a)-[:RELATION]->(b);
MERGE (a:Node {id: 3}) MERGE (b:Node {id: 4}) CREATE (a)-[:RELATION]->(b);
```

### Running command
```cypher
CALL bridges.get() YIELD node_from, node_to
WITH node_from, node_to
MATCH (node_from)-[bridge]-(node_to)
RETURN bridge, node_from, node_to;
```

### Results
```plaintext
+-----------------+-----------------+-----------------+
| bridge          | node_from       | node_to         |
+-----------------+-----------------+-----------------+
| [:RELATION]     | (:Node {id: 3}) | (:Node {id: 4}) |
| [:RELATION]     | (:Node {id: 0}) | (:Node {id: 3}) |
+-----------------+-----------------+-----------------+
```
</Steps>
