---
title: label
description: Organize and categorize your graph elements with Memgraph's Label class, which adds labels to nodes and edges. Make sure to regularly check our documentation to enhance your graph data management.
---

import { Steps } from 'nextra/components'
import { Callout } from 'nextra/components'
import { Cards } from 'nextra/components'
import GitHub from '/components/icons/GitHub'

# label

Labels are used to categorize nodes, and the `label` module provides a function
to check the existence of a label within the node.

<Cards>
  <Cards.Card
    icon={<GitHub />}
    title="Source code"
    href="https://github.com/memgraph/mage/tree/main/cpp/label_module"
  />
</Cards>

| Trait               | Value               |
| ------------------- | ------------------- |
| **Module type**     | util                |
| **Implementation**  | C++                 |
| **Graph direction** | directed/undirected |
| **Edge weights**    | weighted/unweighted |
| **Parallelism**     | sequential          |

## Functions

### `exists()`

Checks whether a specified node is labeled with the provided label.

{<h4> Input: </h4>}

- `node: Any` ➡ The target node for label check.
- `label: string` ➡ Denotes the specific label name to be verified on the given node. 

{<h4> Output: </h4>}

- `bool` ➡ A boolean value indicating whether the specified label is present on
  the provided node. 

{<h4> Usage: </h4>}

The following query checks if the created node labeled `Student` also has a
`Teacher` label:

```cypher
CREATE (:Student {name: 'Ana'});
MATCH (s:Student {name: 'Ana'}) RETURN label.exists(s, "Teacher") AS exists;
```
Results:

```plaintext
+----------------------------+
| exists                     |
+----------------------------+
| False                      |
+----------------------------+
```
