---
title: periodic
description: Get to know how to make use of Memgraph's periodic module to execute a query periodically in batches. Take your graphs to the next level with our documentation and tutorials. 
---

import { Callout } from 'nextra/components'
import { Steps } from 'nextra/components'

# periodic



The **periodic module** enables users to execute a query periodically in
batches. In this case, the name periodic doesn't indicate that the query is
executed after a time interval, but rather that, due to the complexity of the
query, the results of some input source are batched to speed up execution.

<Callout type="warning">

As the results are batched and executed in different transactions, every
executed batch is committed by itself. If an issue occurs while running this
procedure, the already committed batches cannot be rolled back.

</Callout>

[![docs-source](https://img.shields.io/badge/source-graph_util-FB6E00?logo=github&style=for-the-badge)](https://github.com/memgraph/mage/blob/main/cpp/graph_util_module/graph_util_module.cpp)

| Trait               | Value                                                                                                     |
| ------------------- | --------------------------------------------------------------------------------------------------------- |
| **Module type**     | module                               |
| **Implementation**  | C++                                 |
| **Parallelism**     | sequential                         |

### Procedures

### `iterate()`

{<h4> Input: </h4>}

- `input_query: string` ➡ the input query which will yield the results that need to be batched
- `running_query: string` ➡ query which will be executed on the batched results
- `config: Map[string, int]` ➡ parameters for the procedure
  - `batch_size: Integer` ➡ key specifying how many results should a batch contain


{<h4> Output: </h4>}

- `success: boolean` ➡ `true` if the procedure executed successfully, `false` otherwise
- `number_of_executed_batches: Integer` ➡ number of executed batches (possibly a fraction of the full number if the procedure returned `success: false`)

{<h4> Usage: </h4>}

```cypher
CALL periodic.iterate(
  "LOAD CSV FROM '/tmp/file.csv' WITH HEADER AS row RETURN row.node_id AS node_id, row.supernode_id AS supernode_id", 
  "MATCH (s:SuperNode {supernode_id: supernode_id}), (n:Node {node_id: node_id}) CREATE (s)-[:HAS_REL_TO]->(n)", 
  {batch_size: 5000}) 
YIELD * RETURN *;
```

## Example

<Steps>
### Cypher load commands

```cypher
CREATE INDEX ON :SuperNode;
CREATE INDEX ON :SuperNode(supernode_id);
CREATE INDEX ON :Node;
CREATE INDEX ON :Node(node_id);

CREATE (:SuperNode {supernode_id: 1});
FOREACH (i IN range(1, 1000000) | CREATE (:Node {id: i}));
```

### CSV file present

The CSV file should contain the following data:

```cypher
supernode_id,node_id
1,1
1,2
1,3
1,4
1,5
1,6
...
1,999998
1,999999
1,1000000
```

### Running command

```cypher
CALL periodic.iterate(
  "LOAD CSV FROM '/tmp/file.csv' WITH HEADER AS row RETURN row.node_id AS node_id, row.supernode_id AS supernode_id",
  "MATCH (s:SuperNode {supernode_id: supernode_id}), (n:Node {node_id: node_id}) CREATE (s)-[:HAS_REL_TO]->(n)",
  {batch_size: 5000})
YIELD * RETURN *;
```

### Results

```plaintext
+------------------+----------------------------+
| success          | number_of_executed_batches |
+------------------+----------------------------+
| true             | 200                        |
+------------------+----------------------------+
```
</Steps>
