---
title: uuid_generator
description: Effectively manage and create unique identifiers in your graph datasets with Memgraph's uuid_generator algorithm. Discover comprehensive documentation and expert instructions to learn how to use uuid_generator in your graphs.
---

import { Steps } from 'nextra/components'
import { Callout } from 'nextra/components'

# uuid_generator

export const Highlight = ({children, color}) => (
  <span
    style={{
      backgroundColor: color,
      borderRadius: '2px',
      color: '#fff',
      padding: '0.2rem',
    }}>
    {children}
  </span>
);

This module is used to generate string UUIDs which can be stored as properties
on nodes or edges. The underlying implementation makes use of the `uuid-dev`
library. When using the `uuid` module on Linux systems, the library can be
installed by running `sudo apt-get install uuid-dev`.

[![docs-source](https://img.shields.io/badge/source-uuid-FB6E00?logo=github&style=for-the-badge)](https://github.com/memgraph/mage/blob/main/cpp/uuid_module/uuid_module.cpp)

| Trait               | Value                                                 |
| ------------------- | ----------------------------------------------------- |
| **Module type**     | util  |
| **Implementation**  | C++        |
| **Parallelism**     | sequential |

## Procedures

<Callout type="info">
You can execute this algorithm on [graph projections, subgraphs or portions of the graph](/advanced-algorithms/run-algorithms#run-procedures-on-subgraph).
</Callout>

### `get()`

#### Output:

* `uuid` ➡ Returns a UUID string.


#### Usage:
```cypher
MATCH (n)
CALL uuid_generator.get() YIELD uuid
SET n.uuid = uuid
RETURN n.uuid AS node_uuid;
```

## Example

<Steps>
### Input graph

![](/pages/advanced-algorithms/available-algorithms/uuid_generator/uuid-generator-1.png)

### Cypher load commands

```cypher
MERGE (a:Node {id: 0}) MERGE (b:Node {id: 1}) CREATE (a)-[:RELATION]->(b);
MERGE (a:Node {id: 1}) MERGE (b:Node {id: 2}) CREATE (a)-[:RELATION]->(b);
MERGE (a:Node {id: 2}) MERGE (b:Node {id: 0}) CREATE (a)-[:RELATION]->(b);
```

### Running command

```cypher
MATCH (n)
CALL uuid_generator.get() YIELD uuid
SET n.uuid = uuid
RETURN n.uuid AS node_uuid;
```

### Results

```plaintext
+----------------------------------------+
| node_uuid                              |
+----------------------------------------+
| "ef4722b2-628b-4f93-8667-fc91134ed980" |
| "601faade-8c61-4dc3-a68a-693fed4ad40c" |
| "dc4283b8-90d6-402e-8fc0-f37f9959b593" |
+----------------------------------------+
```
</Steps>
