---
title: Custom query modules
description: Expand the capabilities of Memgraph through custom query modules. Effectively create custom query modules and lean how to implement them in your graph analysis in our documentation. 
---

import { Callout } from 'nextra/components'
import { Steps } from 'nextra/components'
import { Tabs, Tab } from 'nextra/components'

# Custom query modules

Many [graph algorithms and uitility
procedures](/advanced-algorithms/available-algorithms) have already been
developed and are available as part of the MAGE library you can add to your
Memgraph installation. The library is already included if you are using Memgraph
Platform or Memgraph MAGE Docker images to run Memgraph.

But, you can also implement custom query modules. Memgraph supports extending
the query language with user-written procedures in **C**, **C++**, **Python**,
and **Rust**. These procedures are grouped into modules - **query module** files
(either `*.so` or `*.py` files).

Every single Memgraph installation comes with the `example.so` and
`py_example.py` query modules located in the `/usr/lib/memgraph/query_modules`
directory. They were provided as examples of query modules for you to examine
and learn from.

Each query module file corresponds to one query module, and file names are
mapped as query module names. For example, `example.so` will be mapped as
`example` module, and `py_example.py` will be mapped as `py_example` module. If
each module file has a procedure called `procedure` defined, those procedures
would be mapped in the Cypher query language as `example.procedure()` and
`py_example.procedure()` respectively.

You can develop custom procedures from Memgraph itself. 

## Develop custom query modules

If you want to develop Python procedures you can do so from [Memgraph
Lab](/data-visualization), the visual user interface. The files will be saved at
`/var/lib/memgraph/internal_modules`. Just navigate to **Query Modules** and
select *+ New Module*.

![](/pages/custom-query-modules/memgraph_lab_query_modules.png)

If you don't won't to develop from Memgraph Lab, you can:
- install MAGE development environment from Docker Hub
- build MAGE using the `docker build` command
- build MAGE from source

Then, select a language you want to develop in. 

### Install MAGE and import query modules

<Tabs items={["Docker Hub","Docker Build","From source"]}>

<Tab> 

        The following steps will guide you through installing MAGE development
        environment from Docker Hub and importing develooped query modules.
        
        <Steps>

        {<h3>Download the MAGE image</h3>} 
        
        Run the following command to get the Memgraph and MAGE development Docker image:

        ```shell
        docker run -p 7687:7687 memgraph/memgraph-mage:<version>-dev
        ```

        By running this command, you will get an image with the following tools
        installed: `Python3`, `Rust`, `Clang`, `Make`, and `CMake`.

        {<h3>Develop a query</h3>} 

        Develop query modules in [Python](/custom-query-modules/python),
        [C](/custom-query-modules/c), [C++](/custom-query-modules/cpp) or
        [Rust](https://github.com/memgraph/mage/tree/main/rust/rsmgp-example). 

        {<h3>Start the MAGE container</h3>} 

        Use the following command to start the MAGE container:

        ```shell
        docker run --rm -p 7687:7687 --name mage memgraph-mage:version-dev
        ```

        Be sure to replace the version with the specific version, for example:

        ```shell
        docker run --rm -p 7687:7687 --name mage memgraph-mage:1.4-dev
        ```

        {<h3>Copy the files to the container</h3>} 

        Copy the files to the container named `mage`:

        ```shell
        docker cp . mage:/mage/
        ```

        {<h3>Enter the container</h3>} 

        Position yourself inside the container as `root`:

        ```shell
        docker exec -u root -it mage /bin/bash
        ```
        <Callout> 

        If you performed the build locally, make sure to delete the `cpp/build` directory because you might be dealing with different architectures or problems with `CMakeCache.txt`. 

        To delete it, run:

        ```shell
        rm -rf cpp/build
        ```

        </Callout>

        {<h3>Build MAGE</h3>} 

        Build MAGE with the option to copy executables from `mage/dist` to `/usr/lib/memgraph/query_modules`:

        ```shell
        python3 setup build -p /usr/lib/memgraph/query_modules/
        ```

        {<h3>Exit the container</h3>} 

        Everything should be ready to exit the container and load the query modules:

        ```shell
        exit
        ```

        </Steps>

</Tab>
<Tab>

    Install MAGE with Docker Build.

    Create a Docker image directly from the [MAGE GitHub
    repository](https://github.com/memgraph/mage), instead of pulling it from the
    Docker Hub.

    <Steps>

    {<h3>Download image or clone the repo</h3>} 

    Download a [specific release](https://github.com/memgraph/mage/releases) from
    the MAGE repository or clone the [repository](https://github.com/memgraph/mage) for the latest
    version.

    ```shell
    git clone --recurse-submodules https://github.com/memgraph/mage.git && cd mage
    ```
    {<h3>Build the MAGE tagged Docker image</h3>}  

    Run the the following command:

    ```shell
    docker build -t memgraph-mage .
    ```

    Verify that the build is successful by starting the built image:

    ```shell
    docker run --rm -p 7687:7687 --name mage memgraph-mage
    ```

    {<h3>Develop modules</h3>} 

    Develop query modules in [Python](/custom-query-modules/python),
    [C](/custom-query-modules/c), [C++](/custom-query-modules/cpp) or
    [Rust](https://github.com/memgraph/mage/tree/main/rust/rsmgp-example). 

    {<h3>Create the `dev` image</h3>} 
    
    To create the `dev` MAGE image, run the following command:

    ```shell
    docker build --target dev -t memgraph-mage:dev .
    ```

    {<h3>Start the container</h3>}  
    
    Start the container with the following command:

    ```shell
    docker run --rm -p 7687:7687 --name mage memgraph-mage:dev
    ```

    {<h3>Copy the files to the container</h3>} 

    Copy the files to the `mage` container:

    ```shell
    docker cp . mage:/mage/
    ```

    {<h3>Enter the container</h3>} 

    Position yourself inside the container as `root`:

    ```shell
    docker exec -u root -it mage /bin/bash
    ```
    <Callout> 

    If you performed the build locally, make sure to delete the `cpp/build` directory because you might be dealing with different architectures or problems with `CMakeCache.txt`. 

    To delete it, run:

    ```shell
    rm -rf cpp/build
    ```

    </Callout>

    {<h3>Build MAGE</h3>} 

    Build MAGE with the option to copy executables from `mage/dist` to `/usr/lib/memgraph/query_modules`:

    ```shell
    python3 setup build -p /usr/lib/memgraph/query_modules/
    ```

    {<h3>Exit the container</h3>} 

    Everything should be ready to exit the container and load the query modules:

    ```shell
    exit
    ```

    </Steps>
</Tab>
<Tab>

    Follow the steps if you want to use the MAGE library with [installed Linux based
    Memgraph package](/getting-started/install-memgraph) and create custom query modules. 

    <Steps>

    {<h3>Install dependencies</h3>} 

    To build from source, you will need:
    - Python3
    - Make
    - CMake
    - Clang
    - UUID 
    - [Rust and Cargo](https://doc.rust-lang.org/cargo/getting-started/installation.html)

    {<h3>Set up the machine</h3>} 

    Run the following commands: 

    ```bash
    sudo apt-get update && apt-get install -y \
        libcurl4        `memgraph` \
        libpython${PY_VERSION}   `memgraph` \
        libssl-dev       `memgraph` \
        openssl         `memgraph` \
        build-essential `mage-memgraph` \
        cmake           `mage-memgraph` \
        curl            `mage-memgraph` \
        g++             `mage-memgraph` \
        python3         `mage-memgraph` \
        python3-pip     `mage-memgraph` \
        python3-setuptools     `mage-memgraph` \
        python3-dev     `mage-memgraph` \
        clang           `mage-memgraph` \
        git             `mage-memgraph` \
        --no-install-recommends \
        && rm -rf /var/lib/apt/lists/* /tmp/* /var/tmp/*
    ```

    {<h3>Download the MAGE source code</h3>} 

    Clone the [MAGE source code](https://github.com/memgraph/mage) from GitHub:

    ```
    git clone --recurse-submodules https://github.com/memgraph/mage.git
    ```

    {<h3>Run the `setup` script</h3>} 

    Run the following command: 

    ```shell
    python3 setup build -p /usr/lib/memgraph/query_modules
    ```

    The script will generate a `dist` directory with all the necessary files.

    It will also copy the contents of the newly created `dist` directory to
    `/usr/lib/memgraph/query_modules`. Memgraph loads algorithms and modules from
    this directory. 

    If something isn't installed properly, the `setup` script will stop the
    installation process. If you have any questions, contact us on
    **[Discord](https://discord.gg/memgraph).**

    {<h5>Set a different `query_modules` directory</h5>}

    The `setup` script can set your local `mage/dist` directory or any other
    directory as the default one by changing the value of the
    `--query-modules-directory` flag in the `/etc/memgraph/memgraph.conf`,
    Memgraph's configuration file. 

    By setting the `/mage/dist` as the default directory you don't need to copy
    `*.so` and `*.py` files from the `mage/dist` directory
    to`/usr/lib/memgraph/query_modules` every time you run `build`:

    ```
    python3 setup modules_storage
    ```

    By setting `<your_directory>` as the default one, Memgraph will be looking for
    query modules inside `<your_directory>`, instead of `/usr/lib/memgraph/query_modules`:

    ```
    python3 setup modules_storage -p <your_directory>
    ```

    Don't forget to copy the aforementioned files from `mage/dist` to
    `<your_directory>`.

    {<h3>Develop modules</h3>} 

    Develop query modules in [Python](/custom-query-modules/python),
    [C](/custom-query-modules/c), [C++](/custom-query-modules/cpp) or
    [Rust](https://github.com/memgraph/mage/tree/main/rust/rsmgp-example). 

    {<h3>Start Memgraph</h3>} 
    
    Make sure your Memgraph instance is running:

    ```
    sudo systemctl status memgraph.service
    ```

    {<h3>Copy the query module</h3>} 
    
    Copy your developed query module to `/usr/lib/memgraph/query_modules` or your directory if you changed the default location of query modules:

    ```shell
    python3 setup build -p /usr/lib/memgraph/query_modules
    ```

    </Steps>

</Tab>

</Tabs>


## Querying

Query modules are loaded into Memgraph on startup, so if your instance was
already running, you need to execute the following query inside one of the
querying platforms ([mgonsole](/getting-started/cli), [Memgraph
Lab](/data-visualization) or a [client library](/client-libraries)) to load
them:

```cypher
CALL mg.load_all();
```

Run a query and test your module. All procedures are called using the `CALL`
clause:

```cypher
MERGE (start:Node {id: 0})-[:RELATION]->(:Node {id: 1})-[:RELATION]->(:Node {id: 2})
CALL random_walk.get(start, 2) YIELD path
RETURN path
```

Since every query module is run as one transaction in Memgraph, the user can
stop the query module by [terminating the corresponding
transaction](/memgraph/reference-guide/transactions), but only if crucial parts
of the code, such as while and until loops, or similar points where the
procedure might become costly, are preceded with CheckMustAbort() function. The
user can then find out the transaction ID using `SHOW TRANSACTIONS` command and
terminate it using the `TERMINATE TRANSACTIONS <tid>` command.

## Testing

Test decoupled parts of your code that don't depend on Memgraph like you would
in any other setting. E2e (end to end) tests, on the other hand, depend on
internal Memgraph data structures, like nodes and edges. After running Memgraph,
we need to prepare the testing environment on the host machine. Position
yourself in the mage directory you cloned from GitHub. The expected folder
structure for each module is the following:

```plaintext
mage
└── e2e
    └── random_walk_test
        └── test_base
            ├── input.cyp
            └── test.yml
```

`input.cyp` represents a Cypher script for entering the data into the database.
To simplify this tutorial, we'll leave the database empty. `test.yml` specifies
which test query should be run by the database and what should be the result or
exception. Create the files following the aforementioned directory structure.

### input.cyp

```cypher
MATCH (n) DETACH DELETE n;
```

### test.yml

```shell
query: >
  MATCH (start:Node {id: 0})
    CALL random_walk.get(start, 2) YIELD path
    RETURN path

output: []
```

Lastly, run the e2e tests with python:

```shell
python test_e2e
```