import { Callout } from 'nextra/components'
import { Steps } from 'nextra/components'
import { Tabs, Tab } from 'nextra/components'

# Custom query modules

Many [graph algorithms and uitility
procedures](/advanced-algorithms/available-algorithms) have already been
developed and are available as part of the MAGE library you can add to your
Memgraph installation. The library is already included if you are using Memgraph
Platform or Memgraph MAGE Docker images to run Memgraph.

But, you can also implement custom query modules. Memgraph supports extending
the query language with user-written procedures in **C**, **C++**, **Python**,
and **Rust**. These procedures are grouped into modules - **query module** files
(either `*.so` or `*.py` files).

Every single Memgraph installation comes with the `example.so` and
`py_example.py` query modules located in the `/usr/lib/memgraph/query_modules`
directory. They were provided as examples of query modules for you to examine
and learn from.

Each query module file corresponds to one query module, and file names are
mapped as query module names. For example, `example.so` will be mapped as
`example` module, and `py_example.py` will be mapped as `py_example` module. If
each module file has a procedure called `procedure` defined, those procedures
would be mapped in the Cypher query language as `example.procedure()` and
`py_example.procedure()` respectively.

You can develop custom procedures from Memgraph itself. 

## Develop custom query modules

If you want to develop Python procedures you can do so from [Memgraph
Lab](/data-visualization), the visual user interface. The files will be saved at
`/var/lib/memgraph/internal_modules`. Just navigate to **Query Modules** and
select *+ New Module*.

![](/pages/custom-query-modules/memgraph_lab_query_modules.png)

If you don't won't to develop from Memgraph Lab, you can:
- [install MAGE development environment from Docker Hub]
- [build MAGE using the `docker build` command]
- [build MAGE from source]

then select a language you want to develop in. 

## Install MAGE and import query modules

<Tabs items={["Docker Hub","Docker build","From source"]}>

<Tab>

        <Steps>

        ### Download the MAGE image 
        
        Run this command to get the Memgraph & MAGE development Docker image:

        ```shell
        docker run -p 7687:7687 memgraph/memgraph-mage:<version>-dev
        ```

        By running this command, you will get an image with the following tools
        installed: `Python3`, `Rust`, `Clang`, `Make`, and `CMake`. This way, you can
        copy files to the container, build them inside and load query modules into
        Memgraph.

        ### Develop a query

        Develop query modules in [Python](/custom-query-modules/python),
        [C](/custom-query-modules/c), [C++](/custom-query-modules/cpp) or
        [Rust](https://github.com/memgraph/mage/tree/main/rust/rsmgp-example). 

        ### Start the MAGE container

        Use the following command to start the MAGE container:

        ```shell
        docker run --rm -p 7687:7687 --name mage memgraph-mage:version-dev
        ```

        Be sure to replace the version with the specific version, for example:

        ```shell
        docker run --rm -p 7687:7687 --name mage memgraph-mage:1.4-dev
        ```

        ### Copy the files to the container

        Copy the files to the container named mage:

        ```shell
        docker cp . mage:/mage/
        ```

        ### Enter the container

        Position yourself inside the container as `root`:

        ```shell
        docker exec -u root -it mage /bin/bash
        ```
        <Callout> 

        If you performed the build locally, make sure to delete the cpp/build directory because you might be dealing with different architectures or problems with `CMakeCache.txt`. 

        To delete it, run:

        ```shell
        rm -rf cpp/build
        ```

        </Callout>

        ### Build MAGE

        Build MAGE with the option to copy executables from `mage/dist` to `/usr/lib/memgraph/query_modules`:

        ```shell
        python3 setup build -p /usr/lib/memgraph/query_modules/
        ```

        ### Exit the container

        Everything should be ready to exit the container and load the query modules:

        ```shell
        exit
        ```

        </Steps>

</Tab>
<Tab>

    Install MAGE with Docker build

    Create a Docker image directly from the [MAGE GitHub
    repository](https://github.com/memgraph/mage), instead of pulling it from the
    Docker Hub.

    <Steps>

    ### Download image or clone the repo

    Download a [specific release](https://github.com/memgraph/mage/releases) from
    the MAGE repository or clone the [repository](https://github.com/memgraph/mage) for the latest
    version.

    ```shell
    git clone --recurse-submodules https://github.com/memgraph/mage.git && cd mage
    ```
    ### Build the MAGE tagged Docker image 

    Run the the following command:

    ```shell
    docker build -t memgraph-mage .
    ```

    Verify that the build is successful by starting the built image:

    ```shell
    docker run --rm -p 7687:7687 --name mage memgraph-mage
    ```

    ### Develop modules

    Develop query modules in [Python](/custom-query-modules/python),
    [C](/custom-query-modules/c), [C++](/custom-query-modules/cpp) or
    [Rust](https://github.com/memgraph/mage/tree/main/rust/rsmgp-example). 

    ### Create the `dev` image
    
    To create the `dev` MAGE image, run the following command:

    ```shell
    docker build --target dev -t memgraph-mage:dev .
    ```

    ### Start the container 
    
    Start the container with the following command:

    ```shell
    docker run --rm -p 7687:7687 --name mage memgraph-mage:dev
    ```

    ### Copy the files to the container

    Copy the files to the `mage` container:

    ```shell
    docker cp . mage:/mage/
    ```

    ### Enter the container

    Position yourself inside the container as `root`:

    ```shell
    docker exec -u root -it mage /bin/bash
    ```
    <Callout> 

    If you performed the build locally, make sure to delete the cpp/build directory because you might be dealing with different architectures or problems with `CMakeCache.txt`. 

    To delete it, run:

    ```shell
    rm -rf cpp/build
    ```

    </Callout>

    ### Build MAGE

    Build MAGE with the option to copy executables from `mage/dist` to `/usr/lib/memgraph/query_modules`:

    ```shell
    python3 setup build -p /usr/lib/memgraph/query_modules/
    ```

    ### Exit the container

    Everything should be ready to exit the container and load the query modules:

    ```shell
    exit
    ```

    </Steps>
</Tab>
<Tab>

    Follow the steps if you want to use the MAGE library with [installed Linux based
    Memgraph package](/getting-started/install-memgraph) and create custom query modules. 

    <Steps>

    ### Install dependencies

    To build from source, you will need:
    - Python3
    - Make
    - CMake
    - Clang
    - UUID 
    - [Rust and Cargo](https://doc.rust-lang.org/cargo/getting-started/installation.html)

    ### Set up the machine

    Run the following commands: 

    ```bash
    sudo apt-get update && apt-get install -y \
        libcurl4        `memgraph` \
        libpython${PY_VERSION}   `memgraph` \
        libssl-dev       `memgraph` \
        openssl         `memgraph` \
        build-essential `mage-memgraph` \
        cmake           `mage-memgraph` \
        curl            `mage-memgraph` \
        g++             `mage-memgraph` \
        python3         `mage-memgraph` \
        python3-pip     `mage-memgraph` \
        python3-setuptools     `mage-memgraph` \
        python3-dev     `mage-memgraph` \
        clang           `mage-memgraph` \
        git             `mage-memgraph` \
        --no-install-recommends \
        && rm -rf /var/lib/apt/lists/* /tmp/* /var/tmp/*
    ```

    ### Download the MAGE source code

    Clone the [MAGE source code](https://github.com/memgraph/mage) from GitHub:

    ```
    git clone --recurse-submodules https://github.com/memgraph/mage.git
    ```


    ### Run the `setup` script

    Run the following command: 

    ```shell
    python3 setup build -p /usr/lib/memgraph/query_modules
    ```

    The script will generate a `dist` directory with all the needed files.

    It will also copy the contents of the newly created `dist` directory to
    `/usr/lib/memgraph/query_modules`. Memgraph loads algorithms and modules from
    this directory. 

    If something isn't installed properly, the `setup` script will stop the
    installation process. If you have any questions, contact us on
    **[Discord](https://discord.gg/memgraph).**

    #### Set a different `query_modules` directory

    The `setup` script can set your local `mage/dist` directory or any other
    directory as the default one by changing the value of the
    `--query-modules-directory` flag in the `/etc/memgraph/memgraph.conf`,
    Memgraph's configuration file. 

    By setting the `/mage/dist` as the default directory you don't need to copy
    `*.so` and `*.py` files from the `mage/dist` directory
    to`/usr/lib/memgraph/query_modules` every time you run `build`:

    ```
    python3 setup modules_storage
    ```

    By setting `<your_directory>` as the default one, Memgraph will be looking for
    query modules inside `<your_directory>`, instead of `/usr/lib/memgraph/query_modules`:

    ```
    python3 setup modules_storage -p <your_directory>
    ```

    Don't forget to copy the aforementioned files from `mage/dist` to
    `<your_directory>`.

    ### Develop modules

    Develop query modules in [Python](/custom-query-modules/python),
    [C](/custom-query-modules/c), [C++](/custom-query-modules/cpp) or
    [Rust](https://github.com/memgraph/mage/tree/main/rust/rsmgp-example). 

    ### Start Memgraph 
    
    Make sure your Memgraph instance is running:

    ```
    sudo systemctl status memgraph.service
    ```

    ### Copy the query module
    
    Copy your developed query module to `/usr/lib/memgraph/query_modules` or your directory if you changed the default location of query modules:

    ```shell
    python3 setup build -p /usr/lib/memgraph/query_modules
    ```

    </Steps>

</Tab>

</Tabs>


## Querying

> Note that query modules are loaded into Memgraph on startup, so if your
> instance was already running, you would need to execute the following query
> inside one of the [querying
> platforms](https://docs.memgraph.com/memgraph/connect-to-memgraph) to load
> them:

```cypher
CALL mg.load_all();
```

Lastly, run a query and test your module:

```cypher
MERGE (start:Node {id: 0})-[:RELATION]->(:Node {id: 1})-[:RELATION]->(:Node {id: 2})
CALL random_walk.get(start, 2) YIELD path
RETURN path
```

Since every query module is run as one transaction in Memgraph, the user can stop
the query module by [terminating the corresponding transaction](/memgraph/reference-guide/transactions). The user first needs
to find out the transaction ID using `SHOW TRANSACTIONS` command and then terminate it
using the `TERMINATE TRANSACTIONS <tid>` command.

## Testing

Test decoupled parts of your code that don't depend on Memgraph like you would
in any other setting. E2e (end to end) tests, on the other hand, depend on
internal Memgraph data structures, like nodes and edges. After running Memgraph,
we need to prepare the testing environment on the host machine. Position
yourself in the mage directory you cloned from GitHub. The expected folder
structure for each module is the following:

```plaintext
mage
└── e2e
    └── random_walk_test
        └── test_base
            ├── input.cyp
            └── test.yml
```

`input.cyp` represents a Cypher script for entering the data into the database.
To simplify this tutorial, we'll leave the database empty. `test.yml` specifies
which test query should be run by the database and what should be the result or
exception. Create the files following the aforementioned directory structure.

### input.cyp

```cypher
MATCH (n) DETACH DELETE n;
```

### test.yml

```shell
query: >
  MATCH (start:Node {id: 0})
    CALL random_walk.get(start, 2) YIELD path
    RETURN path

output: []
```

Lastly, run the e2e tests with python:

```shell
python test_e2e
```

## I don't know what to do with this knowledge

### Memgraph X cuGraph

<Callout type="info">

The development image with cuGraph support is not available yet. If you want to
develop cuGraph-powered query modules in Docker, do not hesitate to [contact
us](https://memgraph.com/community) about it.

</Callout>

#### Building MAGE with NVIDIA cuGraph locally with Docker - what is this

1.  Download the MAGE source code from
    [GitHub](https://github.com/memgraph/mage):

    ```shell
    git clone https://github.com/memgraph/mage.git && cd mage
    ```

2.  Build the **MAGE × cuGraph**-tagged Docker image:

    ```shell
    docker build -f Dockerfile.cugraph -t memgraph-mage .
    ```

3.  Start Memgraph-MAGE with the following command:
    ```shell
    docker run --rm --gpus all -p 7687:7687 -p 7444:7444 --name mage memgraph-mage
    ```

<Callout type="info">

You can now query Memgraph from querying platforms such as [Memgraph
Lab](https://memgraph.com/product/lab) or
[mgconsole](https://github.com/memgraph/mgconsole).

If you made any changes while the Docker container was running, you need to stop
the container and rebuild the image. For a workaround, check [Development
process for MAGE with
Docker](/advanced-algorithms/install-mage).

</Callout>

### Load custom query modules

Once you start Memgraph, it will attempt to load query modules from all *.so and
*.py files from the default directories. MAGE modules are located at
`/usr/lib/memgraph/query_modules` by default, but Memgraph will also load any
modules located at `/var/lib/memgraph/internal_modules`.

If the files were added while Memgraph was already running, they can be manually
loaded into Memgraph using the following query:

```
CALL mg.load_all();
```